02-shockTube-case2/sod_shock_tube/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues 
( 
    volVectorFieldValue U (0 0 0) 
    volScalarFieldValue T 293 
    volScalarFieldValue p 120000 
);

regions         
( 
    boxToCell 
    { 
        box (0.5 -100 -100) (100 100 100) ; 
        fieldValues 
        (
            volScalarFieldValue T 293
            volScalarFieldValue p 100000
        ); 
     } 
);

// ************************************************************************* //
